Applying **stage**:
```diff
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/exaf-epfl/african-cities-lab-org-stage/runs/run-YtmRepuB9osEhtAG

Waiting for the plan to start...

Terraform v1.7.2
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.base: Reading...
data.terraform_remote_state.base: Read complete after 0s
module.app.github_repository_environment.env: Refreshing state... [id=african-cities-lab-org:stage]
module.app.data.digitalocean_domain.domain: Reading...
module.app.digitalocean_droplet.droplet: Refreshing state... [id=408938785]
module.app.github_actions_environment_secret.tfvars["stage_traefik"]: Refreshing state... [id=african-cities-lab-org:stage:stage_traefik]
module.app.github_actions_environment_secret.tfvars["prod_postgres"]: Refreshing state... [id=african-cities-lab-org:stage:prod_postgres]
module.app.github_actions_environment_secret.tfvars["prod_traefik"]: Refreshing state... [id=african-cities-lab-org:stage:prod_traefik]
module.app.github_actions_environment_secret.tfvars["prod_django"]: Refreshing state... [id=african-cities-lab-org:stage:prod_django]
module.app.github_actions_environment_secret.tfvars["stage_django"]: Refreshing state... [id=african-cities-lab-org:stage:stage_django]
module.app.data.digitalocean_domain.domain: Read complete after 1s [id=africancitieslab.org]
module.app.digitalocean_spaces_bucket.bucket: Refreshing state... [id=african-cities-lab-org-stage]
module.app.github_actions_environment_secret.droplet_host: Refreshing state... [id=african-cities-lab-org:stage:droplet_host]
module.app.digitalocean_record.a: Refreshing state... [id=1726056918]
module.app.digitalocean_project_resources.resources: Refreshing state... [id=5c331857-e58d-4200-aa6f-d36d7ece134f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.github_actions_environment_secret.tfvars["prod_django"] must be replaced
-/+ resource "github_actions_environment_secret" "tfvars" {
      ~ created_at      = "2024-06-10 13:12:51 +0000 UTC" -> (known after apply)
      ~ id              = "african-cities-lab-org:stage:prod_django" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-06-10 13:12:51 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.app.github_actions_environment_secret.tfvars["stage_django"] must be replaced
-/+ resource "github_actions_environment_secret" "tfvars" {
      ~ created_at      = "2024-06-10 13:12:52 +0000 UTC" -> (known after apply)
      ~ id              = "african-cities-lab-org:stage:stage_django" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-06-10 13:12:52 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.app.digitalocean_spaces_bucket.bucket,
│   on .terraform/modules/app/terraform/modules/app/digitalocean.tf line 17, in resource "digitalocean_spaces_bucket" "bucket":
│   17: resource "digitalocean_spaces_bucket" "bucket" {
│ 
│ Terraform will only perform drift detection if a configuration value is
│ provided. Use the resource `digitalocean_spaces_bucket_cors_configuration`
│ instead.
╵

```
```
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/exaf-epfl/african-cities-lab-org-stage/runs/run-fX3B9ybmS9sjo19V

Waiting for the plan to start...

Terraform v1.7.2
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.base: Reading...
data.terraform_remote_state.base: Read complete after 1s
module.app.github_repository_environment.env: Refreshing state... [id=african-cities-lab-org:stage]
module.app.data.digitalocean_domain.domain: Reading...
module.app.digitalocean_droplet.droplet: Refreshing state... [id=408938785]
module.app.github_actions_environment_secret.tfvars["stage_traefik"]: Refreshing state... [id=african-cities-lab-org:stage:stage_traefik]
module.app.github_actions_environment_secret.tfvars["prod_postgres"]: Refreshing state... [id=african-cities-lab-org:stage:prod_postgres]
module.app.github_actions_environment_secret.tfvars["prod_django"]: Refreshing state... [id=african-cities-lab-org:stage:prod_django]
module.app.github_actions_environment_secret.tfvars["stage_django"]: Refreshing state... [id=african-cities-lab-org:stage:stage_django]
module.app.github_actions_environment_secret.tfvars["prod_traefik"]: Refreshing state... [id=african-cities-lab-org:stage:prod_traefik]
module.app.data.digitalocean_domain.domain: Read complete after 0s [id=africancitieslab.org]
module.app.digitalocean_spaces_bucket.bucket: Refreshing state... [id=african-cities-lab-org-stage]
module.app.github_actions_environment_secret.droplet_host: Refreshing state... [id=african-cities-lab-org:stage:droplet_host]
module.app.digitalocean_record.a: Refreshing state... [id=1726056918]
module.app.digitalocean_project_resources.resources: Refreshing state... [id=5c331857-e58d-4200-aa6f-d36d7ece134f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.github_actions_environment_secret.tfvars["prod_django"] must be replaced
-/+ resource "github_actions_environment_secret" "tfvars" {
      ~ created_at      = "2024-06-10 13:12:51 +0000 UTC" -> (known after apply)
      ~ id              = "african-cities-lab-org:stage:prod_django" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-06-10 13:12:51 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.app.github_actions_environment_secret.tfvars["stage_django"] must be replaced
-/+ resource "github_actions_environment_secret" "tfvars" {
      ~ created_at      = "2024-06-10 13:12:52 +0000 UTC" -> (known after apply)
      ~ id              = "african-cities-lab-org:stage:stage_django" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-06-10 13:12:52 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.app.digitalocean_spaces_bucket.bucket,
│   on .terraform/modules/app/terraform/modules/app/digitalocean.tf line 17, in resource "digitalocean_spaces_bucket" "bucket":
│   17: resource "digitalocean_spaces_bucket" "bucket" {
│ 
│ Terraform will only perform drift detection if a configuration value is
│ provided. Use the resource `digitalocean_spaces_bucket_cors_configuration`
│ instead.
╵

module.app.github_actions_environment_secret.tfvars["stage_django"]: Destroying... [id=african-cities-lab-org:stage:stage_django]
module.app.github_actions_environment_secret.tfvars["prod_django"]: Destroying... [id=african-cities-lab-org:stage:prod_django]
module.app.github_actions_environment_secret.tfvars["prod_django"]: Destruction complete after 0s
module.app.github_actions_environment_secret.tfvars["prod_django"]: Creating...
module.app.github_actions_environment_secret.tfvars["stage_django"]: Destruction complete after 1s
module.app.github_actions_environment_secret.tfvars["stage_django"]: Creating...
module.app.github_actions_environment_secret.tfvars["stage_django"]: Creation complete after 4s [id=african-cities-lab-org:stage:stage_django]
module.app.github_actions_environment_secret.tfvars["prod_django"]: Creation complete after 6s [id=african-cities-lab-org:stage:prod_django]

Apply complete! Resources: 2 added, 0 changed, 2 destroyed.

Outputs:

droplet_host = "165.227.138.207"

```